app/Controllers/Users.php

	public function register(){
		$data = [];
		helper(['form']);

		if ($this->request->getMethod() == 'post') {
			//let's do the validation here
			$rules = [
				'firstname' => 'required|min_length[3]|max_length[20]',
				'lastname' => 'required|min_length[3]|max_length[20]',
				'email' => 'required|min_length[6]|max_length[50]|valid_email|is_unique[users.email]',
				'password' => 'required|min_length[8]|max_length[255]',
				'password_confirm' => 'matches[password]',
			];

			if (! $this->validate($rules)) {
				$data['validation'] = $this->validator;
			}else{
				$model = new UserModel();

				$newData = [
					'firstname' => $this->request->getVar('firstname'),
					'lastname' => $this->request->getVar('lastname'),
					'email' => $this->request->getVar('email'),
					'password' => $this->request->getVar('password'),
				];
				$model->save($newData);
---
INSERT INTO `users` (`firstname`, `lastname`, `email`, `password`, `created_at`) VALUES ('ilies', 'tyuio', 'wsdddd@fffff.fr', '$2y$10$0C7JvmJEK2uLlylgRSXp7.YzqJYKsz8M.UsLL1bTHqGScjnnLEoj2', '2022-10-05 14:33:22')